###########################################################################
# 
# Generated by : Version 10.1 Build 197 01/19/2011 Service Pack 1 SJ Full Version
#
# Project      : DE2_70
# Revision     : DE2_70
#
# Date         : Fri Feb 03 15:23:20 +1100 2012
#
###########################################################################
 
 
# WARNING: Expected ENABLE_CLOCK_LATENCY to be set to 'ON', but it is set to 'OFF'
#          In SDC, create_generated_clock auto-generates clock latency
#
# ------------------------------------------
#
# Create generated clocks based on PLLs
derive_pll_clocks -use_tan_name
#
# ------------------------------------------


# Original Clock Setting Name: CCD_PIXCLK
create_clock -name CCD_PIXCLK -period 16.667 [get_ports {GPIO_CLKIN_N1}]
# ---------------------------------------------


# Original Clock Setting Name: CLK50
create_clock -period "20.000 ns" -name {iCLK_50} {iCLK_50}
# ---------------------------------------------


# Original Clock Setting Name: CCD_MCLK
create_clock -name CCD_MCLK -period 40.000 [get_ports {GPIO_CLKOUT_N1}]

# ---------------------------------------------


# Original Clock Setting Name: DRAM0_CLK
create_clock -period "6.666 ns" \
             -name {oDRAM0_CLK} {oDRAM0_CLK}
# ---------------------------------------------


# Original Clock Setting Name: iCLK_50_3
create_clock -period "20.000 ns" \
             -name {iCLK_50_3} {iCLK_50_3}
# ---------------------------------------------


# Original Clock Setting Name: iCLK_50_2
create_clock -period "20.000 ns" \
             -name {iCLK_50_2} {iCLK_50_2}
# ---------------------------------------------

# ** Clock Latency
#    -------------

# ** Clock Uncertainty
#    -----------------

# ** Multicycles
#    -----------
# ** Cuts
#    ----

# ** Input/Output Delays
#    -------------------




# ** Tpd requirements
#    ----------------

# ** Setup/Hold Relationships
#    ------------------------

# ** Tsu/Th requirements
#    -------------------
# QSF: -name TSU_REQUIREMENT 5 ns -from * -to *
set_max_delay 5 -from [get_ports *] -to [get_registers {rCCD_DATA[*]}]
# QSF: -name TSU_REQUIREMENT 5 ns -from * -to rCCD_FVAL
set_max_delay 5 -from [get_ports *] -to [get_registers {rCCD_FVAL}]
# QSF: -name TSU_REQUIREMENT 5 ns -from * -to rCCD_LVAL
set_max_delay 5 -from [get_ports *] -to [get_registers {rCCD_LVAL}]
# QSF: -name TSU_REQUIREMENT 1 ns -from DRAM_DQ -to *
set_max_delay 1 -from [get_ports {DRAM_DQ[*]}] -to [get_registers *]


# ** Tco/MinTco requirements
#    -----------------------
# --------------
# Represent unkown external clock as N/C (Not a Clock)
create_clock -name "N/C" -period 10.0

# --------------
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|mCCD_DATA
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u2|mCCD_DATA}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u2|mCCD_DATA}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|Pre_FVAL
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u3|Pre_FVAL}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u3|Pre_FVAL}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to CCD_Capture:u3|mCCD_LVAL
set_output_delay 0.0 -clock "N/C" [get_ports {CCD_Capture:u3|mCCD_LVAL}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {CCD_Capture:u3|mCCD_LVAL}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to DRAM_DQ
set_output_delay 0.0 -clock "N/C" [get_ports {DRAM_DQ[*]}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {DRAM_DQ[*]}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to Sdram_Control_4Port:u6|mDATAOUT
set_output_delay 0.0 -clock "N/C" [get_ports {Sdram_Control_4Port:u6|mDATAOUT}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {Sdram_Control_4Port:u6|mDATAOUT}]
# QSF: -name TCO_REQUIREMENT 1 ns -from * -to Sdram_Control_4Port:u11|mDATAOUT
set_output_delay 0.0 -clock "N/C" [get_ports {Sdram_Control_4Port:u11|mDATAOUT}]
set_max_delay 1 -from [get_keepers *] -to [get_ports {Sdram_Control_4Port:u11|mDATAOUT}]



# ---------------------------------------------
# The following clock group is added to try to 
# match the behavior of:
#   CUT_OFF_PATHS_BETWEEN_CLOCK_DOMAINS = ON
# ---------------------------------------------

set_clock_groups -asynchronous \
                 -group { \
                       GPIO_CLKOUT_N1 \
                        } \
                 -group { \
                       GPIO_CLKIN_N1 \
                        } \
                 -group { \
                       vga_pll:u5|altpll:altpll_component|_clk0 \
                       iCLK_50_2 \
                        } \
                 -group { \
                       oDRAM0_CLK \
                        } \
                 -group { \
                       sdram_pll:u6|altpll:altpll_component|_clk0 \
                       sdram_pll:u6|altpll:altpll_component|_clk1 \
                       sdram_pll:u6|altpll:altpll_component|_clk2 \
                       iCLK_50_3 \
                        } \
                 -group { \
                       iCLK_50 \
                        } \

# ---------------------------------------------

